## [Pandas 데이터프레임 특정 열값의 데이터 타입 변경하기](https://wonhwa.tistory.com/14)

In [1]:
import pandas as pd
from numpy import NaN, NAN, nan # 누락값 넣기 위한 모듈 불러오기

In [4]:
df = pd.DataFrame({'구분': [1,2,3,4,5,6],
                  '인허가일자': [20160312, '2020.02.01', 201603, 99991230, 1980, 192012],
                  '휴업일자': [20160312.0, '2020.320', 201603.0, NaN, '2020-02-22', '']})

In [5]:
df

   구분       인허가일자        휴업일자
0   1    20160312  20160312.0
1   2  2020.02.01    2020.320
2   3      201603    201603.0
3   4    99991230         NaN
4   5        1980  2020-02-22
5   6      192012

### step1. 빈칸을 NaN으로 채우기

In [6]:
# 비어 있는 값을 NaN으로 바꾸기
df = df.replace(r'^\s*$', NaN, regex=True)
df

   구분       인허가일자        휴업일자
0   1    20160312  20160312.0
1   2  2020.02.01    2020.320
2   3      201603    201603.0
3   4    99991230         NaN
4   5        1980  2020-02-22
5   6      192012         NaN

### step2. NaN을 다른 값으로 변경하기

In [7]:
# 누락값 처리 NaN을 다른 값으로 변경하기
df = df.fillna(0) # 다른 값 변경시, fillna(변경할 숫자).iloc[행위치, 열위치] 입력하여 변경
df

   구분       인허가일자        휴업일자
0   1    20160312  20160312.0
1   2  2020.02.01    2020.320
2   3      201603    201603.0
3   4    99991230           0
4   5        1980  2020-02-22
5   6      192012           0

### step3. 문자열을 정수로 변환하기

In [8]:
# 문자열을 정수로 변경하기
import re
# string의 특수문자 제거하는 함수
def cleanString(x):
    x1 = '' # string 타입
    if type(x1) == type(x):
        x = re.sub('[-=.#/?:$}]', '', x) # 특수문자 제거
        x1 = x.replace(" ", "") # 공백제거
        return int(x1)
    else:
        return x

In [11]:
# 인허가일자 str int로 변환하기
df['인하가일자'] = df['인허가일자'].apply(cleanString)

# 휴업일자 str int로 변환하기
df['휴업일자'] = df['휴업일자'].apply(cleanString)

# 휴업일자 float 타입을 int로 바꾸기
df['휴업일자'] = df['휴업일자'].astype('int64')

In [12]:
df

   구분       인허가일자      휴업일자     인하가일자
0   1    20160312  20160312  20160312
1   2  2020.02.01   2020320  20200201
2   3      201603    201603    201603
3   4    99991230         0  99991230
4   5        1980  20200222      1980
5   6      192012         0    192012